app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
 def index
@post = Post.find(params[:post_id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 1 AND (`comments`.post_id = 1))
---
def show
	@post = Post.find(params[:post_id])
	@comment = @post.comments.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
def new
	@post = Post.find(params[:post_id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`updated_at`, `body`, `post_id`, `commenter`, `created_at`) VALUES('2010-04-17 01:47:36', 'This Is mY First Comment', 1, 'Mukesh Kumar Sahu', '2010-04-17 01:47:36')
---
def create
	@post = Post.find(params[:post_id])
	@comment = @post.comments.build(params[:comment])
 	if @comment.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 3 AND (`comments`.post_id = 1))
---
def edit
	@post = Post.find(params[:post_id])
	@comment = @post.comments.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 3)
UPDATE `comments` SET `body` = 'jndjesndjsnd j\r\nsdsd hsdhsbd\r\nsdshds dya kar rahe ho bawa Upadatd', `commenter` = 'Third Coemment Updated', `updated_at` = '2010-04-17 01:48:43' WHERE `id` = 3
---
def update
	@post = Post.find(params[:post_id])
	@comment = Comment.find(params[:id])
	if @comment.update_attributes(params[:comment])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.`id` = 2)
DELETE FROM `comments` WHERE `id` = 2
---
def destroy
	@post = Post.find(params[:post_id])
	@comment = Comment.find(params[:id])
	@comment.destroy