app/controllers/posts_controller.rb

INSERT INTO `posts` (`name`, `updated_at`, `title`, `content`, `created_at`) VALUES('Happy Thouhts', '2010-04-16 12:35:24', 'Sada Muskurate Raho', 'This is English Contentsdsds\r\nsdsbds dh', '2010-04-16 12:35:24')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `content` = 'CCCCCCCCCCCC\r\nFFFFFFFFFFFFFFF\r\nSSSSSSSSSSSSSSSSSSSSS\r\nRRRRRRRRRRRRRRRRRR\r\nNNNNNNNNNNNNNNNNNNNNNN\r\ndfkdnfjdnjd fdjf', `title` = 'BBBBBBBBBTTTTTTT', `updated_at` = '2010-04-16 16:54:59', `name` = 'AAAAAAAAAFFF' WHERE `id` = 8
---
  def update
 #   @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM `posts` WHERE `id` = 4
---
  def destroy
#    @post = Post.find(params[:id])
    @post.destroy

SELECT * FROM `posts` WHERE (`posts`.`id` = 4)
---
	def find_post
		@post = Post.find(params[:id])